exercise7/Master Yii/controllers/PostsController.php

	public function actionIndex()
    {
        $searchModel = new PostsSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
		$query = Trivias::find()
		->orderBy(new Expression('rand()'))
		->limit(5)
		->all();
---
SELECT * FROM `trivias` ORDER BY rand() LIMIT 5